USE [StudentGradesDB]
GO

DELETE [dbo].[StudentGrades]
GO
DELETE [dbo].[Courses]
GO
DELETE [dbo].[Students]
GO

--RESEED
DBCC CHECKIDENT ('[dbo].[Courses]', RESEED, 0);
GO
DBCC CHECKIDENT ('[dbo].[StudentGrades]', RESEED, 0);
GO
DBCC CHECKIDENT ('[dbo].[Students]', RESEED, 0);
GO

INSERT INTO [dbo].[Students] (FirstName, LastName, Patronymic, BirthDate)  
VALUES ('Иван', 'Иванов', 'Иванович', '2001-03-02'),
	('Сергей', 'Сергеев', 'Сергеевич', '2002-11-05'),
	('Александр', 'Александров', 'Александрович', '2000-10-04'),
	('Семен', 'Семенов', 'Семенович', '2003-01-01'),
	('Константин', 'Виноградов', 'Иванович', '2002-06-02'),
	('Дмитрий', 'Костров', 'Антонович', '2002-15-02'),
	('Арина', 'Белянцева', 'Сергеевна', '2001-16-08'),
	('Татьяна', 'Невзорова', 'Алексеевна', '2003-12-06'),
	('Светлана', 'Цветова', 'Владиславовна', '2002-15-07'),
	('Ольга', 'Никулина', 'Сергеевна', '2002-13-08'),
	('Арсений', 'Мелихов', 'Сергеевич', '2001-18-04'),
	('Артем', 'Мурашев', 'Антонович', '2002-10-01'),
	('Екатерина', 'Пескова', 'Дмитриевна', '2001-12-09'),
	('Вероника', 'Степанова', 'Алексеевна', '2002-12-04'),
	('Александра', 'Ветрова', 'Станиславовна', '2000-17-10'),
	('Константин', 'Симонов', 'Константинович', '2000-17-11'); 
GO

SELECT * FROM [dbo].[Students]
GO

INSERT INTO [dbo].[Courses] (CourseName, CourseDescription, CourseTime)  
VALUES ('Математика', 'Курс по математике', 50),
	('Русский язык', 'Курс русского языка', 30),
	('Английский язык', 'Курс английского языка', 30),
	('Информатика', 'Курс по информатике', 25),
	('Химия', 'Курс неорганической химии', 15),
	('Физкультура', 'Курс физической культуры', 10); 
GO

SELECT * FROM [dbo].[Courses]
GO


INSERT INTO [dbo].[StudentGrades] ([GradeDate], [Grade], [Student_StudentId], [Course_CourseId])  
VALUES
('2017-05-06', 3, 1, 1),
('2017-05-05', 3, 1, 2),
('2017-05-01', 5, 1, 3),
('2017-05-05', 4, 1, 4),
('2017-05-08', 3, 1, 5),
('2017-05-07', 5, 1, 6),
('2017-05-04', 4, 2, 1),
('2017-05-01', 5, 2, 2),
('2017-05-06', 5, 2, 3),
('2017-05-03', 5, 2, 4),
('2017-05-06', 5, 2, 5),
('2017-05-01', 3, 2, 6),
--('2017-05-08', 5, 3, 1),
('2017-05-02', 3, 3, 2),
('2017-05-04', 4, 3, 3),
('2017-05-07', 3, 3, 4),
('2017-05-06', 3, 3, 5),
('2017-05-02', 5, 3, 6),
('2017-05-03', 5, 4, 1),
('2017-05-04', 4, 4, 2),
('2017-05-08', 4, 4, 3),
('2017-05-01', 4, 4, 4),
('2017-05-08', 4, 4, 5),
('2017-05-07', 4, 4, 6),
('2017-05-01', 5, 5, 1),
('2017-05-04', 5, 5, 2),
('2017-05-04', 4, 5, 3),
('2017-05-06', 5, 5, 4),
('2017-05-01', 4, 5, 5),
('2017-05-01', 3, 5, 6),
('2017-05-06', 4, 6, 1),
('2017-05-08', 4, 6, 2),
('2017-05-02', 4, 6, 3),
('2017-05-01', 3, 6, 4),
('2017-05-03', 3, 6, 5),
('2017-05-05', 5, 6, 6),
('2017-05-05', 5, 7, 1),
('2017-05-06', 3, 7, 2),
('2017-05-07', 4, 7, 3),
('2017-05-02', 4, 7, 4),
('2017-05-01', 4, 7, 5),
('2017-05-01', 4, 7, 6),
('2017-05-02', 5, 8, 1),
('2017-05-08', 3, 8, 2),
('2017-05-05', 3, 8, 3),
('2017-05-06', 5, 8, 4),
('2017-05-07', 4, 8, 5),
('2017-05-06', 4, 8, 6),
('2017-05-06', 5, 9, 1),
('2017-05-02', 4, 9, 2),
('2017-05-04', 4, 9, 3),
('2017-05-03', 5, 9, 4),
('2017-05-03', 4, 9, 5),
('2017-05-03', 4, 9, 6),
('2017-05-06', 4, 10, 1),
('2017-05-01', 4, 10, 2),
('2017-05-03', 4, 10, 3),
('2017-05-01', 3, 10, 4),
('2017-05-04', 4, 10, 5),
('2017-05-02', 3, 10, 6),
('2017-05-06', 5, 11, 1),
('2017-05-06', 5, 11, 2),
('2017-05-05', 5, 11, 3),
('2017-05-01', 3, 11, 4),
('2017-05-02', 3, 11, 5),
('2017-05-04', 3, 11, 6),
('2017-05-03', 5, 12, 1),
('2017-05-01', 4, 12, 2),
('2017-05-02', 3, 12, 3),
('2017-05-02', 4, 12, 4),
('2017-05-05', 4, 12, 5),
('2017-05-05', 3, 12, 6),
('2017-05-03', 3, 13, 1),
('2017-05-05', 3, 13, 2),
('2017-05-03', 4, 13, 3),
('2017-05-01', 3, 13, 4),
('2017-05-04', 5, 13, 5),
('2017-05-06', 5, 13, 6),
('2017-05-07', 4, 14, 1),
('2017-05-02', 4, 14, 2),
('2017-05-05', 3, 14, 3),
('2017-05-02', 4, 14, 4),
('2017-05-01', 5, 14, 5),
('2017-05-02', 4, 14, 6),
('2017-05-04', 4, 15, 1),
('2017-05-07', 3, 15, 2),
('2017-05-02', 5, 15, 3),
('2017-05-06', 3, 15, 4),
('2017-05-02', 5, 15, 5),
('2017-05-06', 4, 15, 6),
('2017-05-02', 5, 16, 1),
('2017-05-08', 4, 16, 2),
('2017-05-02', 3, 16, 3),
('2017-05-05', 4, 16, 4),
('2017-05-01', 4, 16, 5),
('2017-05-06', 5, 16, 6);
GO

INSERT INTO [dbo].[StudentGrades] ([GradeDate], [Grade], [Student_StudentId], [Course_CourseId], [Comment]) 
VALUES
	('2017-05-02', 2, 3, 1, 'Списывал, на пересдачу!'),
	('2017-05-08', 5, 3, 1, 'Пересдал');
GO

SELECT * FROM [dbo].[StudentGrades]
GO

--ТЕСТ

SELECT * FROM [dbo].[Students] INNER JOIN [dbo].[StudentGrades] ON [dbo].[Students].[StudentID] = [dbo].[StudentGrades].[Student_StudentId]
GO